// Потребовать ввод от пользователя
Console.Write("Enter your name: ");

// Считать введенное имя с консоли
string userName = Console.ReadLine();

// Вывести приветствие на консоль
Console.WriteLine($"Hello {userName}!");

// Ждать, пока пользователь нажмет клавишу перед выходом
Console.ReadLine();
